Melroy-Sahyadri-ECE/esp32-wifi-balancing-robot/esp32_wifi_balancing_robot/main.cpp
  if (OSCnewMessage) {
    OSCnewMessage = 0;
    processOSCMsg();
  }

  unsigned long currentMillis = millis();
  
  // PID control loop - runs every 5ms
  if (currentMillis - lastPIDUpdate >= PIDInterval) {
    lastPIDUpdate = currentMillis;
    
    if (MPU6050_newData()) {
      MPU6050_read_3axis();
      
      // Get angle from MPU6050 (using existing function)
      timer_value = micros();
      dt = (timer_value - timer_old) * 0.000001;
      timer_old = timer_value;
      
      float MPU_sensor_angle = MPU6050_getAngle(dt);
      currentAngle = MPU_sensor_angle + angle_offset;
      
      // Enhanced angle smoothing for better accuracy and less jerkiness
      smoothedAngle += 0.15 * (currentAngle - smoothedAngle); // Increased smoothing
      
      // Smooth web control inputs for gradual response
      smoothThrottle += smoothingFactor * (webThrottle - smoothThrottle);
      smoothSteering += smoothingFactor * (webSteering - smoothSteering);
      
      // Enhanced PID calculation with smoother web control integration
      float targetAngle = pidSetpoint + (smoothThrottle * throttleSensitivity * 0.06); // Reduced throttle influence
      float error = targetAngle - smoothedAngle;
      
      // Improved integral control with better limits
      if (abs(error) < 2.0 && abs(smoothedAngle) < 12.0) { // Tighter conditions for integral
        pidIntegral += error * (PIDInterval / 1000.0);
      } else if (abs(error) > 8.0) {
        pidIntegral *= 0.9; // More aggressive integral reduction for large errors
      }
      pidIntegral = constrain(pidIntegral, -20, 20); // Tighter integral limits
      
      // Smoother derivative calculation
      float derivative = (error - pidLastError) / (PIDInterval / 1000.0);
      pidLastError = error;
      
      float pidOutput = (pidKp * error) + (pidKi * pidIntegral) + (pidKd * derivative);
      
      // Enhanced steering calculation with proper differential control
      // For left turn: left motor slower/backward, right motor faster/forward
      // For right turn: right motor slower/backward, left motor faster/forward
      float steeringCommand = smoothSteering * steeringSensitivity * 1.5; // Increased steering sensitivity
      
      // Apply differential steering - left motor is motor1, right motor is motor2
      motor1Speed = (int)constrain(pidOutput - steeringCommand, -6000, 6000); // Left motor
      motor2Speed = (int)constrain(pidOutput + steeringCommand, -6000, 6000); // Right motor
      
      // Improved deadzone with smoother behavior
      static bool inDeadzone = false;
      static int deadzoneCycles = 0;
      
      if (!inDeadzone && abs(smoothedAngle) < 0.3 && abs(smoothThrottle) < 3 && abs(smoothSteering) < 1) {
        deadzoneCycles++;
        if (deadzoneCycles > 8) { // Longer stabilization period
          inDeadzone = true;
          deadzoneCycles = 0;
        }
      } else if (inDeadzone && (abs(smoothedAngle) > 0.8 || abs(smoothThrottle) > 5 || abs(smoothSteering) > 2)) {
        inDeadzone = false;
        deadzoneCycles = 0;
      }
      
      if (inDeadzone) {
        motor1Speed = 0;
        motor2Speed = 0;
        pidIntegral *= 0.95; // Slower integral decay for smoother transitions
      }
      
      // Comprehensive debug output
      static int debug_counter = 0;
      debug_counter++;
      if (debug_counter >= 400) { // Every 2 seconds (faster PID loop)
        debug_counter = 0;
        Serial.print("Angle: ");
        Serial.print(smoothedAngle, 2);
        Serial.print("° | Target: ");
        Serial.print(targetAngle, 2);
        Serial.print("° | Web T/S: ");
        Serial.print(webThrottle, 1);
        Serial.print("/");
        Serial.print(webSteering, 1);
        Serial.print(" | Smooth T/S: ");
        Serial.print(smoothThrottle, 1);
        Serial.print("/");
        Serial.print(smoothSteering, 1);
        Serial.print(" | M1(L)/M2(R): ");
        Serial.print(motor1Speed);
        Serial.print("/");
        Serial.print(motor2Speed);
        Serial.print(" | Status: ");
        Serial.println((abs(smoothedAngle) < 45) ? "BALANCING" : "DISABLED");
      }
    }
  }
  
  // Motor control - runs continuously for smooth stepping
  motorControl();
}

void motorControl() {
  // Only run motors if angle is reasonable (within ±45 degrees)
  if (abs(smoothedAngle) < 45.0 && (abs(motor1Speed) > 0 || abs(motor2Speed) > 0)) {
    // Enable motors
    digitalWrite(PIN_ENABLE_MOTORS, LOW);
    
    // Motor 1 control (Left Motor)
    if (abs(motor1Speed) > 0) {
      digitalWrite(PIN_MOTOR1_DIR, motor1Speed > 0 ? HIGH : LOW);
      unsigned long stepInterval1 = 1000000 / abs(motor1Speed);
      stepInterval1 = constrain(stepInterval1, 60, 50000); // Lower minimum for faster response
      
      if (micros() - lastStepTime1 >= stepInterval1) {
        lastStepTime1 = micros();
        digitalWrite(PIN_MOTOR1_STEP, HIGH);
        delayMicroseconds(4); // Longer pulse for better stepper response
        digitalWrite(PIN_MOTOR1_STEP, LOW);
      }
    }
    
    // Motor 2 control (Right Motor)
    if (abs(motor2Speed) > 0) {
      digitalWrite(PIN_MOTOR2_DIR, motor2Speed > 0 ? HIGH : LOW);
      unsigned long stepInterval2 = 1000000 / abs(motor2Speed);
      stepInterval2 = constrain(stepInterval2, 60, 50000); // Lower minimum for faster response
      
      if (micros() - lastStepTime2 >= stepInterval2) {
        lastStepTime2 = micros();
        digitalWrite(PIN_MOTOR2_STEP, HIGH);
        delayMicroseconds(4); // Longer pulse for better stepper response
        digitalWrite(PIN_MOTOR2_STEP, LOW);
      }
    }
  } else {
    // Disable motors when not balancing
    digitalWrite(PIN_ENABLE_MOTORS, HIGH);
    motor1Speed = 0;
    motor2Speed = 0;
    pidIntegral = 0; // Reset integral when motors disabled
  }
}

void processOSCMsg() {
  if (OSCpage == 1) {
    if (modifing_control_parameters)  // We came from the settings screen
    {
      OSCfader[0] = 0.5; // default neutral values
      OSCfader[1] = 0.5; // default neutral values
      OSCtoggle[0] = 0;  // Normal mode
      mode = 0;
      modifing_control_parameters = false;
    }

    if (OSCmove_mode) {
      Serial.print("M ");
      Serial.print(OSCmove_speed);
      Serial.print(" ");
      Serial.print(OSCmove_steps1);
      Serial.print(",");
      Serial.println(OSCmove_steps2);
      positionControlMode = true;
      OSCmove_mode = false;
      target_steps1 = steps1 + OSCmove_steps1;
      target_steps2 = steps2 + OSCmove_steps2;
    } else {
      positionControlMode = false;
      
      // Enhanced web control mapping for precise movement
      // Forward/Backward: Convert fader to -100 to +100 range
      webThrottle = (OSCfader[0] - 0.5) * 200.0;
      webThrottle = constrain(webThrottle, -100, 100);
      
      // Left/Right: Enhanced steering with progressive response
      float steerInput = (OSCfader[1] - 0.5) * 2.0; // -1 to +1 range
      
      // Progressive steering curve for better control
      // Negative values = LEFT turn, Positive values = RIGHT turn
      if (abs(steerInput) < 0.05) {
        webSteering = 0; // Smaller dead zone for better response
      } else if (abs(steerInput) < 0.3) {
        // Fine control for small movements
        webSteering = steerInput * 50.0;
      } else {
        // Progressive increase for larger movements
        float sign = (steerInput > 0) ? 1.0 : -1.0;
        float absInput = abs(steerInput);
        webSteering = sign * (15.0 + (absInput - 0.3) * 150.0); // 15 to 120 range
      }
      
      webSteering = constrain(webSteering, -100, 100); // Full range steering
      
      // Debug output for steering
      Serial.print("SteerInput="); Serial.print(steerInput, 3);
      Serial.print(" webSteering="); Serial.println(webSteering, 1);
    }

    if ((mode == 0) && (OSCtoggle[0])) {
      // Change to PRO mode
      max_throttle = MAX_THROTTLE_PRO;
      max_steering = MAX_STEERING_PRO;
      max_target_angle = MAX_TARGET_ANGLE_PRO;
      mode = 1;
    }
    if ((mode == 1) && (OSCtoggle[0] == 0)) {
      // Change to NORMAL mode
      max_throttle = MAX_THROTTLE;
      max_steering = MAX_STEERING;
      max_target_angle = MAX_TARGET_ANGLE;
      mode = 0;
    }
  } else if (OSCpage == 2) { // OSC page 2
    if (!modifing_control_parameters) {
      for (uint8_t i = 0; i < 4; i++)
        OSCfader[i] = 0.5;
      OSCtoggle[0] = 0;

      modifing_control_parameters = true;
      //OSC_MsgSend("$P2", 4);
    }
    // User could adjust KP, KD, KP_THROTTLE and KI_THROTTLE (fadder3,4,5,6)
    // Now we need to adjust all the parameters all the times because we dont know what parameter has been moved
    Kp_user = KP * 2 * OSCfader[0];
    Kd_user = KD * 2 * OSCfader[1];
    Kp_thr_user = KP_THROTTLE * 2 * OSCfader[2];
    Ki_thr_user = KI_THROTTLE * 2 * OSCfader[3];
    // Send a special telemetry message with the new parameters
    char auxS[50];
    sprintf(auxS, "$tP,%d,%d,%d,%d", int(Kp_user * 1000), int(Kd_user * 1000), int(Kp_thr_user * 1000), int(Ki_thr_user * 1000));
    //OSC_MsgSend(auxS, 50);


    // Calibration mode??
    if (OSCpush[2] == 1) {
      Serial.print("Calibration MODE ");
      angle_offset = angle_adjusted_filtered;
      Serial.println(angle_offset);
    }

    // Kill robot => Sleep
    while (OSCtoggle[0] == 1) {
      //Reset external parameters
      PID_errorSum = 0;
      timer_old = millis();
      setMotorSpeedM1(0);
      setMotorSpeedM2(0);
      digitalWrite(PIN_ENABLE_MOTORS, HIGH);  // Disable motors
    }
  }
}